diagrams refined
